{"pageProps":{"articleData":{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center Workforce Management Team Request Tracker","slug":"contact-center-workforce-management-team-request-tracker","description":"The contact center work force management team are constantly asked to make updates to telecom system and agent's system. With over 1600 schedules to manage, and only 12 people to work the requests, what can be done to manage the chaos?","content":"<p>The people responsible for managing the telecom system, setting agents schedules, skills, and other important data recieve many requests per day. Certain Workforce Management Employees are designated responsibilities to specific service lines. Some requests need to be processed immediately, while others need to be processed in the future. The person responsible for managing the productivity of their employees needed a way to keep track of how many requests were coming in and how timely they were being responded to.</p>\n<p>This was a business process that began with the business creating a SharePoint list, and they setup a process where Supervisors that needed the assistance of a Workforce Management team member would submit the request by creating a new item on this SharePoint list. The WFM team recieved a notification each time an item was created, the appropriate person would work the request, and an email would go back to the person that created the item to let them know that their request had been completed, or needed more information, and etc. They would then export the SharePoint list to excel and perform some pivots to analyze the productivity of the Workforce Management Employees. The SharePoint list views were in a constant state of being over the size limit, that this process just became unmanageable from a SharePoint perspective.</p>\n<p>I transitioned all of the processes supported by this SharePoint list to a .NET Framework MVC Web App \"from soup to nuts\".</p>\n<p>The SQL Server was setup as having extra Schema's and Tables added to the <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database.</p>\n<p>This application went live in production on April 29th, 2020 and is still in use today. There have already been over 32,000 requests tracked in this system.</p>","uuid":"08da6c01-99b6-4e92-89d9-41297b517a16","date":1619102669064}},"__N_SSG":true}