{"pageProps":{"articleData":{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center Multiple Knowledge Base Search","slug":"contact-center-multiple-knowledge-base-search","description":"Sending filter requests to multiple information silos and coming back with baked bread.","content":"<p>The contact center has been doing well at obtaining new clients. Each time a client was obtained a new knowledge management database and web app were set up. While the URLs, connection strings, and permissions were different. The database structure and application structure stayed mostly the same.</p>\n<p>As the company progressed, they looked for efficiencies, so naturally one efficiency that was discovered was to have agents trained to take calls from different clients. This led to the agent needing to have multiple favorites, and search through multiple databases to get the information that they needed. In order to make these agent's more efficient a new system that could query each of the knowledge bases was needed.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>In this application I was fortunate that each database was at least on the same server. Therefore I could simply connect my web app to the \"master\" sql server database, and as I generated queries which my web app would use based on the user input I just had to make union queries that were in the form of selecting from [DatabaseName].[SchemaName].[TableName].</p>\n<p>I also set it up to scale, so that any time a new knowledge management system was set up that I would add that as a record to a metadata table that was tracking which databases were in scope for each query, and which database mapped to which URL.</p>\n<p>This application is using ASP.NET Core hosting a React app. So I first created a RESTFUL API for the React app to consume. Then client side routing and rendering was generated in the react app.</p>\n<p>The application went live on September 9th, 2020. I did not put any tracking on to this web app, but I do know that it is being used by more than 800 people making hundreds of queries per day.</p>","uuid":"e66a1502-5a26-46bd-9639-51f1aa64adce","date":1619026440849}},"__N_SSG":true}