{"pageProps":{"categoryDetails":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711,"articlesInCategory":[{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center After Hours Messaging","slug":"contact-center-after-hours-messaging","description":"Messages received over night need to be handled in the morning.","content":"<p>The contact center had a process where they would receive specific phone calls from specific customer's which would be handled by a different on-site support team the following morning. This support team didn't have a formalized ticket system; however they did need to receive the messages. The group did not want to receive the messages one at a time, rather they wanted the messages to come in one day at a time in one spreadsheet.</p>\n<p>The business had already put together a SharePoint system where they would record these calls on a SharePoint list, export the list to Excel, email the list, and mark the items as \"Sent\".</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I added one new Schema's and a few Tables to the existing <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database.</p>\n<p>The application was written using .NET Framework. One Web App, and a Microservice that ran every day to automatically send the night's messages in one spreadsheet to a specific distribution list of email addresses.</p>\n<p>The application went live on October 15th, 2019, and still in use today. It has been used to track over 7,500 messages.</p>","uuid":"76c46123-060a-410a-acc2-f6d43db1baaa","date":1618952270717},{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center CSAT Removal Request System","slug":"contact-center-csat-removal-request-system","description":"Did the customer press the wrong button while rating their experience talking with their customer service representative? What happens then?","content":"<p>In a world where excellence is expected, and the input to a reporting system can be imperfect. It is hard to balance what is written in the record compared to what the customer intended to indicate and thus how well the contact center agent is performing.</p>\n<p>The Reporting Analysts and Quality Analysts do not have a way to overwrite the result of a Customer Satisfaction score; however, the agents, supervisors, and Quality Analysts did desire a way to appeal the results of a Customer Satisfaction score.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I added a few additional Schema's and Tables to the existing <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database. The design of this database was unique in which a number of the tables were load tables to take information from Telecom (Genesys / I3) system which would be used by the Reporting Analyst team to use as a new source of truth for CSAT reporting. I decided stil not to alter the data coming in from the telecom system, but approval CSAT removals would not appear in views.</p>\n<p>The application was written using .NET Framework.</p>\n<p>I programmed an API middleware that would take a request where the consumer would provide an Interaction Id, and the service would return CSAT data related to that Interaction Id. As a Supervisor is filling out the form to request a CSAT removal they could provide the Interaction Id, and then they woud click on a \"Validate / Populate\" button. The API would be invoked and the form fields would auto populate with the data that was returned from API, and then they could explain their reasons for the removal, and it would then go through the approval work-flow. Once approved the CSAT was removed from the view that the Reporting Analysts would use for calculating CSAT scores.</p>\n<p>The application went live on February 1st 2020.&nbsp; It is used by all Supervisors at the contact center on an as needs basis, a handful of Quality Managers (who review and approve / deny removal requests). The application has tracked over 7,500 CSAT removal requests.</p>","uuid":"3f538b70-39ba-4049-83ec-d11cf137c828","date":1618950904016},{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center Master Roster","slug":"contact-center-master-roster","description":"Sometimes in a big organization the groups performing the various operations of a business do not manage their employee's the same way that Human Resources does. Workforce Management team members, Service Line Directors, Managers, and Supervisors all need to be on the same page about employee resources, and how they can be best utilized to maintain service levels.","content":"<p>Creating the MasterRoster Web App was chalk full of many opportunities to combine many processes that were being tracked in various spreadsheets.</p>\n<p>The primary focus of this application was to at least have data management around a specific demographic of employees at the contact center. Such that the heiararchy, capabilities, and availability of these contact center agents could be known by a Workforce Management team, as well as by Service Line Directors, Managers, and Supervisors. They also needed to have performance metric data about these employees as well as One on Ones, and Absences.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I designed the Microsoft SQL Server Database Structure. This design was especially important because it would be used as the backbone for other applications to be built on top of. I was aware that I was going to be able to setup some ETL processes from Human Resources, Windows, and Reporting Analyst teams in to this database. Thus this database was designed to have multipe Schema's and tables in those Schema's rather than all tables going to the dbo Schema.</p>\n<p>The standard adopted by the Web Development team that I am on chose ASP.NET Framework with Entity Framework as the server side framework to work with. So from a support stand point this was the framework used. Many Models, Views (allot of JavaScript for each view), and Controllers were developed in order to support all of the business processes that were requested by the stake holders.</p>\n<p>This application needed many ETL processes setup for it. Rather than SSIS packages, I chose to develop a series of Console Applications using TopShelf and Fluent Scheduler to turn the Console Application in to a microservice that could be hosted on other application servers. A particular advantage to this was that I was able to use a \"Core\" class Library that held all of the Database Models, and Entity Framework Context which could be a project reference for the Web Application, and each ETL Console application.</p>\n<p>The web application and 5 supporting ETL processes went live to production on August 7th, 2019. There have been many incremental updates to the system since then. The solution is still in use today by over 1,600 active Contact Center employees including Directors, Managers and Supervisors and 12 Workforce Management Employees. Not only is this a repository for agent demographics and statistics, but the results of over 23,700 One On One interactions have been recorded between Supervisor and Agent, and Manager and Supervisor as well.</p>","uuid":"f2518102-4f46-4eb0-bb00-af40dcc13b94","date":1618946270782},{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center Quality Auditing Tracker","slug":"contact-center-quality-auditing-tracker","description":"Capturing and recording the results of a Quality Audit on an interaction might be easy. But when every agent needs to be audited 4 times a month it is hard to determine how audits have been performed and still need to be performed.","content":"<p>This process started by using the <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> spreadsheet spoken of before. The Quality Management team at the Contact Center needed the basic demographic information on the agent's so that they could identify who needed to be audited. They also had a policy that each agent would be audited 4 times a month.</p>\n<p>After the MasterRoster was transitioned to a web application, it only made sense to make this the next business process to be transitioned to a web application.&nbsp;</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>Due to the design of the MasterRoster database it was easy to add an additional Schema and a few tables to the existing database.</p>\n<p>This is a .NET Framework application and is a sub-app of the main MasterRoster web app when looking at it from an IIS perspective.</p>\n<p>The application went live on October 16th, 2019. The application is used by 10 active Quality Auditors per day. It has recorded over 52,000 audit requirements and over 93,000 audit attempts.</p>","uuid":"303e5724-fe66-409a-8a7b-f459dd10be8c","date":1618945976951},{"category":{"title":"Projects","slug":"projects","description":"A collection of Projects that I have been apart of.","uuid":"2ee94573-dd0f-4f8f-a5a5-8c64af57327e","date":1618936509711},"title":"Contact Center Message Processing Tracker","slug":"contact-center-message-processing-tracker","description":"The contact center is very good at measuring an agent's productivity while they are taking phone calls. What about when they need to work messages coming from different systems. How can you measure their productivity?","content":"<p>The contact center has a specific team that responds to messages that either show up as Work Items in the Electronic Health Record system or emails in Outlook. Since the items that they are working on are in two different systems it is hard to measure the response time and messages worked. Therefore a web application was requested where the people working the messages could enter generic details about each message they worked such that reporting on how productive they were in achieving service levels was possible. They also needed to keep track of how many messages were remaining to be worked by the end of each shift.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I designed the Microsoft SQL Server Database Structure. This database design was fairly simple. I only needed a few Lookup tables and the main transactional table. The business already had a report which was an Excel workbook with 4 worksheets that categorized the information that they wanted. A number of Views were generated to support the data from these worksheets to be displayed in the web app.</p>\n<p>This particular Web App used ASP.NET Core MVC as it's framework. A particular interesting request for this was to have a \"Start\" / \"Stop\" timer because these employeer's are multi-taskers and must stop working on the message if they reeive a phone call. This allowed us to calculate the processing time of each message. I was able to implement this timer using JavaScript on the Create / Edit screens.</p>\n<p>The application went live on December 1st, 2018. The application is actively used by about 20 people per day and so far has tracked over 189,000 processed messages.</p>","uuid":"5664fb43-89df-41c2-adf6-20192deb6351","date":1618943456229}]}},"__N_SSG":true}