{
	"category": "2ee94573-dd0f-4f8f-a5a5-8c64af57327e",
	"title": "Contact Center After Hours End of Shift Reporting",
	"slug": "contact-center-after-hours-end-of-shift-reporting",
	"description": "What were the metrics by the end of the day? What were the metrics by the end of the shift? What alerts and client issues were encountered during the shift? Why sort through 3 different reports to make those call outs? What were the results of previous call outs without sorting through emails?",
	"content": "<p>The After Hours End of Shift web application was unique in that they were compiling email messages to send to a distribution list of people to let those people know every night:</p>\n<ul>\n<li>Statistical Data for specific Telecom work queue's for the previous day</li>\n<li>Statistical Data for specific Telecom work queue's during the shift</li>\n<li>Client issues (such as an On-Call being unreachable)</li>\n<li>Alerts received from various monitoring systems</li>\n</ul>\n<p>Before this was made in to a web app / process automation they were recording the Client Issues and Alterts on SharePoint, then exporting them to Excel and marking the items as \"Sent\". Then they would have to dig through their emails to find the statistical data for the work queues. One email would contain the Days total, adn another email would contain the Shift's totals. This would be considered their End of Shift report.</p>\n<p>The challengers were not only finding those pieces of information to compile the End of Shift Report, but also to find the results of previous End of Shift reports except for wading through emails.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>A few Schema's and Tables were added to the existing <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database.</p>\n<p>The Web app had connectivity to read/write access to the MasterRoster and read only access to the telecom system, such that we could use the actual SQL queries used by the reporting analyst team to generate in the web app the same reports that they were emailing out. The web app had functionality allowing them to create a new End of Shift report on a daily basis. They would add Client Issues and Alerts to each End of Shift report. They then could email the End of Shift report at will once they were satisfied that what was recorded on the web page was satisfactory. They also had a screen where they could look at any previous report.</p>\n<p>The Web App went live on April 29th, 2020 and is still in use today. It has been used to record 360 End of Shift reports, 507 Client Issues, and 345 Alerts.</p>",
	"uuid": "18b0cfec-d58e-472c-ae29-ab729f759ab2",
	"date": 1619024993295
}