{
	"category": "2ee94573-dd0f-4f8f-a5a5-8c64af57327e",
	"title": "Contact Center CSAT Removal Request System",
	"slug": "contact-center-csat-removal-request-system",
	"description": "Did the customer press the wrong button while rating their experience talking with their customer service representative? What happens then?",
	"content": "<p>In a world where excellence is expected, and the input to a reporting system can be imperfect. It is hard to balance what is written in the record compared to what the customer intended to indicate and thus how well the contact center agent is performing.</p>\n<p>The Reporting Analysts and Quality Analysts do not have a way to overwrite the result of a Customer Satisfaction score; however, the agents, supervisors, and Quality Analysts did desire a way to appeal the results of a Customer Satisfaction score.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I added a few additional Schema's and Tables to the existing <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database. The design of this database was unique in which a number of the tables were load tables to take information from Telecom (Genesys / I3) system which would be used by the Reporting Analyst team to use as a new source of truth for CSAT reporting. I decided stil not to alter the data coming in from the telecom system, but approval CSAT removals would not appear in views.</p>\n<p>The application was written using .NET Framework.</p>\n<p>I programmed an API middleware that would take a request where the consumer would provide an Interaction Id, and the service would return CSAT data related to that Interaction Id. As a Supervisor is filling out the form to request a CSAT removal they could provide the Interaction Id, and then they woud click on a \"Validate / Populate\" button. The API would be invoked and the form fields would auto populate with the data that was returned from API, and then they could explain their reasons for the removal, and it would then go through the approval work-flow. Once approved the CSAT was removed from the view that the Reporting Analysts would use for calculating CSAT scores.</p>\n<p>The application went live on February 1st 2020.&nbsp; It is used by all Supervisors at the contact center on an as needs basis, a handful of Quality Managers (who review and approve / deny removal requests). The application has tracked over 7,500 CSAT removal requests.</p>",
	"uuid": "3f538b70-39ba-4049-83ec-d11cf137c828",
	"date": 1618950904016
}