{
	"category": "2ee94573-dd0f-4f8f-a5a5-8c64af57327e",
	"title": "Contact Center Message Processing Tracker",
	"slug": "contact-center-message-processing-tracker",
	"description": "The contact center is very good at measuring an agent's productivity while they are taking phone calls. What about when they need to work messages coming from different systems. How can you measure their productivity?",
	"content": "<p>The contact center has a specific team that responds to messages that either show up as Work Items in the Electronic Health Record system or emails in Outlook. Since the items that they are working on are in two different systems it is hard to measure the response time and messages worked. Therefore a web application was requested where the people working the messages could enter generic details about each message they worked such that reporting on how productive they were in achieving service levels was possible. They also needed to keep track of how many messages were remaining to be worked by the end of each shift.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I designed the Microsoft SQL Server Database Structure. This database design was fairly simple. I only needed a few Lookup tables and the main transactional table. The business already had a report which was an Excel workbook with 4 worksheets that categorized the information that they wanted. A number of Views were generated to support the data from these worksheets to be displayed in the web app.</p>\n<p>This particular Web App used ASP.NET Core MVC as it's framework. A particular interesting request for this was to have a \"Start\" / \"Stop\" timer because these employeer's are multi-taskers and must stop working on the message if they reeive a phone call. This allowed us to calculate the processing time of each message. I was able to implement this timer using JavaScript on the Create / Edit screens.</p>\n<p>The application went live on December 1st, 2018. The application is actively used by about 20 people per day and so far has tracked over 189,000 processed messages.</p>",
	"uuid": "5664fb43-89df-41c2-adf6-20192deb6351",
	"date": 1618943456229
}