{
	"category": "2ee94573-dd0f-4f8f-a5a5-8c64af57327e",
	"title": "Contact Center Peer to Peer Assistance Tracker",
	"slug": "contact-center-peer-to-peer-assistance-tracker",
	"description": "Contact Center's are very well equipped to record interactions that agent's have with customers. This project was set up to help track agent's helping other agent's.",
	"content": "<p>There came a time when the business discovered that they have some agents with more experience than others. They wanted to make those with more experience to have more accessibility for those that did not. They also wanted to identify trends in those questions and answers to help drive huddles and team meetings. In order to make that happen though a repository of what was asked by who, and how that was answered and by who and when was needed.</p>\n<p>I developed this application \"from soup to nuts\" as a full stack developer.</p>\n<p>I developed the SQL server database by adding a new Schema and sufficient tables to the existing <a href=\"../../blog/projects/contact-center-master-roster\">MasterRoster</a> database as per the requirements given around what they wanted to have tracked. I also created user defined functions that returned tables and took a few parameters that the reports would be providing to generate the views which the web app would be consuming.</p>\n<p>I had just started learning about Blazor and decided that this would be a good project to apply those lessons to. This particular application was made as a Blazor server app (as apposed to a Blazor Web Assembly App).</p>\n<p>One thing that I found particularly interesting about coding in Blazor is that it is all C#. In a typical MVC environment you will be coding C# for your Controllers, and Models, and then views are a mixuture of HTML and JavaScript. So being able to rely strictly on one language and not the other was certainly an advantage. I personally have learned more about JavaScript than C# anyways, so it was challenging some times to understand a Blazor / C# equivelent to what I was trying to accomplish in JavaScript, but it was still possible. And when I just could not find a way around it, I was able to use the JavaScript interop functionality provided by Blazor, but I was able to keep that at a minimum.</p>\n<p>The application went live on March 17th, 2021 and still in use today. It is used by about 10 people per day and has already recorded 280 assistance requests.</p>",
	"uuid": "68c38e47-9a1a-492d-8f7f-d84f1ff0360f",
	"date": 1619027900145
}