{
	"category": "1eb2ff9f-366f-44f4-a40c-1dcd362ddaab",
	"title": "Employee of the Month for September 2015",
	"slug": "employee-of-the-month-for-september-2015",
	"description": "Employee of the Month Patient Access Solutions Division for September 2015",
	"content": "<p>I obtained an Employee of the Month Award in Steptember 2015 for maintaining and spreading the <a href=\"../../blog/achievements-awards/distinguished-masters-thesis-award\">AnswerPath solution</a> (referred to below as Interaction Workflow system) throughout the Contact Center system. I also had developed some Access Database Solutions before I had the appropriate Web Development tools on my computer, and before formally being transitioned to the team that handles those things. I also had ensured a smooth upgrade of our SharePoint system from 2007 to 2013.</p>\n<p><img class=\"img-fluid\" src=\"../../../EOM_2015_09.jpg\" alt=\"\" width=\"768\" height=\"570\" /></p>\n<p>The nomination which won me this award read as follows:</p>\n<p>&nbsp;</p>\n<hr />\n<p style=\"padding-left: 40px;\">I would like to nominate Sean Woodward for EOM for September. Since joining the company one year ago, Sean has engineered a number of novel solutions to improve work at the PSC, including the development of custom tools and databases. His contributions include a tracking and reporting tool for the Transitions of Care and MPHS ED Discharge projects, the implementation of dynamic/interactive workflows, an overhaul of the Master Roster, an Attendance Database, and a more in-depth Improvement Log system. Most notably, he made the upgrade to SharePoint 2013 a seamless project for the PSC by developing a database to track the hundreds of pages requiring validation and producing daily reporting to keep leaders updated on his team's progress. He asked for permission to be in the building at 2:30am on Saturday to verify that all pages were working correctly, and the systems administrator overseeing the upgrade said that, \"I've been through 7 of these migrations and I must say that this is by far the most prepared one I've seen.\" Sean has done more than maintain our SharePoint sites, much more than I ever anticipated could be done when he joined us 11 months ago, and I look forward to the many contributions he will make in the future.</p>\n<hr />",
	"uuid": "aab077c7-01c0-4863-ba7b-ea66cd112ed3",
	"date": 1619125050989
}